aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_tests/firmware/src/config/pic32mzef_nvm/driver/ethmac/src/dynamic/drv_eth_pic32_lib.h
/*******************************************************************************
  Ethernet Driver Library Interface Header

  Company:
    Microchip Technology Inc.

  File Name:
    drv_eth_pic32_lib.h

  Summary:
    Defines the Ethernet Driver Library Interface.

  Description:
    This header file contains the function prototypes and definitions of
    the data types and constants that make up the interface to the Ethernet
    Driver Library for Microchip microcontrollers.  The definitions in this 
    file are for the Ethernet module.
*******************************************************************************/

// DOM-IGNORE-BEGIN
/*****************************************************************************
 Copyright (C) 2008-2018 Microchip Technology Inc. and its subsidiaries.

Microchip Technology Inc. and its subsidiaries.

Subject to your compliance with these terms, you may use Microchip software 
and any derivatives exclusively with Microchip products. It is your 
responsibility to comply with third party license terms applicable to your 
use of third party software (including open source software) that may 
accompany Microchip software.

THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A PARTICULAR 
PURPOSE.

IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE 
FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN 
ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY, 
THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
*****************************************************************************/
// DOM-IGNORE-END

#ifndef _DRV_ETH_LIB_H_
#define _DRV_ETH_LIB_H_

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <xc.h>

#ifdef __cplusplus  // Provide C++ Compatibility

    extern "C" {

#endif

// *****************************************************************************
// *****************************************************************************
// Section: Constants & Data Types
// *****************************************************************************
// *****************************************************************************

// layout of the Ethernet registers        
typedef struct __attribute__ ((packed , aligned(4)))
{
 __ETHCON1bits_t	ETHCON1;
volatile uint32_t        ETHCON1CLR ;
volatile uint32_t        ETHCON1SET ;
volatile uint32_t        ETHCON1INV ;

 __ETHCON2bits_t	ETHCON2;
 volatile uint32_t        ETHCON2CLR ;
 volatile uint32_t        ETHCON2SET ;
 volatile uint32_t        ETHCON2INV ;

 __ETHTXSTbits_t		ETHTXST ;
 volatile uint32_t        ETHTXSTCLR ;
 volatile uint32_t        ETHTXSTSET ;
 volatile uint32_t        ETHTXSTINV ;
 
 __ETHRXSTbits_t		ETHRXST ;
 volatile uint32_t        ETHRXSTCLR ;
 volatile uint32_t        ETHRXSTSET ;
 volatile uint32_t        ETHRXSTINV ;

 __ETHHT0bits_t        ETHHT0 ;
 volatile uint32_t        ETHHT0CLR ;
 volatile uint32_t        ETHHT0SET ;
 volatile uint32_t        ETHHT0INV ;

 __ETHHT1bits_t        ETHHT1 ;
 volatile uint32_t        ETHHT1CLR ;
 volatile uint32_t        ETHHT1SET ;
 volatile uint32_t        ETHHT1INV ;

 __ETHPMM0bits_t 	  ETHPMM0 ;
 volatile uint32_t        ETHPMM0CLR ;
 volatile uint32_t        ETHPMM0SET ;
 volatile uint32_t        ETHPMM0INV ;

 __ETHPMM1bits_t 	  ETHPMM1 ;
 volatile uint32_t        ETHPMM1CLR ;
 volatile uint32_t        ETHPMM1SET ;
 volatile uint32_t        ETHPMM1INV ;

 __ETHPMCSbits_t      ETHPMCS ;
 volatile uint32_t        ETHPMCSCLR ;
 volatile uint32_t        ETHPMCSSET ;
 volatile uint32_t        ETHPMCSINV ;

 __ETHPMObits_t        ETHPMO ;
 volatile uint32_t        ETHPMOCLR ;
 volatile uint32_t        ETHPMOSET ;
 volatile uint32_t        ETHPMOINV ;
 
 __ETHRXFCbits_t	   ETHRXFC ;
 volatile uint32_t        ETHRXFCCLR ;
 volatile uint32_t        ETHRXFCSET ;
 volatile uint32_t        ETHRXFCINV ;

 __ETHRXWMbits_t         ETHRXWM ;
 volatile uint32_t        ETHRXWMCLR ;
 volatile uint32_t        ETHRXWMSET ;
 volatile uint32_t        ETHRXWMINV ;

 __ETHIENbits_t         ETHIEN ;
 volatile uint32_t        ETHIENCLR ;
 volatile uint32_t        ETHIENSET ;
 volatile uint32_t        ETHIENINV ;

 __ETHIRQbits_t         ETHIRQ ;
 volatile uint32_t        ETHIRQCLR ;
 volatile uint32_t        ETHIRQSET ;
 volatile uint32_t        ETHIRQINV ;

 __ETHSTATbits_t         ETHSTAT ;

 volatile uint32_t   	  addroffset[7];
 
 __ETHRXOVFLOWbits_t		ETHRXOVFLOW ;
 volatile uint32_t        ETHRXOVFLOWCLR ;
 volatile uint32_t        ETHRXOVFLOWSET ;
 volatile uint32_t        ETHRXOVFLOWINV ;

 __ETHFRMTXOKbits_t		ETHFRMTXOK ;
 volatile uint32_t        ETHFRMTXOKCLR ;
 volatile uint32_t        ETHFRMTXOKSET ;
 volatile uint32_t        ETHFRMTXOKINV ;

 __ETHSCOLFRMbits_t		ETHSCOLFRM ;
 volatile uint32_t        ETHSCOLFRMCLR ;
 volatile uint32_t        ETHSCOLFRMSET ;
 volatile uint32_t        ETHSCOLFRMINV ;

 __ETHMCOLFRMbits_t		ETHMCOLFRM ;
 volatile uint32_t        ETHMCOLFRMCLR ;
 volatile uint32_t        ETHMCOLFRMSET ;
 volatile uint32_t        ETHMCOLFRMINV ;

 __ETHFRMRXOKbits_t      ETHFRMRXOK ;
 volatile uint32_t        ETHFRMRXOKCLR ;
 volatile uint32_t        ETHFRMRXOKSET ;
 volatile uint32_t        ETHFRMRXOKINV ;

 __ETHFCSERRbits_t       ETHFCSERR ;
 volatile uint32_t        ETHFCSERRCLR ;
 volatile uint32_t        ETHFCSERRSET ;
 volatile uint32_t        ETHFCSERRINV ;

 __ETHALGNERRbits_t      ETHALGNERR ;
  volatile uint32_t        ETHALGNERRCLR ;
 volatile uint32_t        ETHALGNERRSET ;
 volatile uint32_t        ETHALGNERRINV ;

 volatile uint32_t   	  addroffset1[36];
 
 __EMACxCFG1bits_t       EMACxCFG1 ;
 volatile uint32_t        EMACxCFG1CLR ;
 volatile uint32_t        EMACxCFG1SET ;
 volatile uint32_t        EMACxCFG1INV ;

 __EMACxCFG2bits_t       EMACxCFG2 ;
 volatile uint32_t        EMACxCFG2CLR ;
 volatile uint32_t        EMACxCFG2SET ;
 volatile uint32_t        EMACxCFG2INV ;

 __EMACxIPGTbits_t       EMACxIPGT ;
 volatile uint32_t        EMACxIPGTCLR ;
 volatile uint32_t        EMACxIPGTSET ;
 volatile uint32_t        EMACxIPGTINV ;

 __EMACxIPGRbits_t       EMACxIPGR ;
 volatile uint32_t        EMACxIPGRCLR ;
 volatile uint32_t        EMACxIPGRSET ;
 volatile uint32_t        EMACxIPGRINV ;

 __EMACxCLRTbits_t       EMACxCLRT ;
 volatile uint32_t        EMACxCLRTCLR ;
 volatile uint32_t        EMACxCLRTSET ;
 volatile uint32_t        EMACxCLRTINV ;

