aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_tests/firmware/src/config/pic32mzef_nvm/driver/ethmac/src/dynamic/drv_eth_pic32_lib.h
 __EMACxMAXFbits_t       EMACxMAXF ;
 volatile uint32_t        EMACxMAXFCLR ;
 volatile uint32_t        EMACxMAXFSET ;
 volatile uint32_t        EMACxMAXFINV ;

 __EMACxSUPPbits_t       EMACxSUPP ;
 volatile uint32_t        EMACxSUPPCLR ;
 volatile uint32_t        EMACxSUPPSET ;
 volatile uint32_t        EMACxSUPPINV ;

 __EMACxTESTbits_t       EMACxTEST ;
 volatile uint32_t        EMACxTESTCLR ;
 volatile uint32_t        EMACxTESTSET ;
 volatile uint32_t        EMACxTESTINV ;

 __EMACxMCFGbits_t       EMACxMCFG ;
 volatile uint32_t        EMACxMCFGCLR ;
 volatile uint32_t        EMACxMCFGSET ;
 volatile uint32_t        EMACxMCFGINV ;

 __EMACxMCMDbits_t       EMACxMCMD ;
 volatile uint32_t        EMACxMCMDCLR ;
 volatile uint32_t        EMACxMCMDSET ;
 volatile uint32_t        EMACxMCMDINV ;

 __EMACxMADRbits_t       EMACxMADR ;
 volatile uint32_t        EMACxMADRCLR ;
 volatile uint32_t        EMACxMADRSET ;
 volatile uint32_t        EMACxMADRINV ;


 __EMACxMWTDbits_t  	EMACxMWTD ;
 volatile uint32_t        EMACxMWTDCLR ;
 volatile uint32_t        EMACxMWTDSET ;
 volatile uint32_t        EMACxMWTDINV ;

 __EMACxMRDDbits_t       EMACxMRDD ;
 volatile uint32_t        EMACxMRDDCLR ;
 volatile uint32_t        EMACxMRDDSET ;
 volatile uint32_t        EMACxMRDDINV ;

 __EMACxMINDbits_t       EMACxMIND ;
 volatile uint32_t        EMACxMINDCLR ;
 volatile uint32_t        EMACxMINDSET ;
 volatile uint32_t        EMACxMINDINV ;
 
 volatile uint32_t  addroffset2[8];	

 __EMACxSA0bits_t        EMACxSA0 ;
 volatile uint32_t        EMACxSA0CLR ;
 volatile uint32_t        EMACxSA0SET ;
 volatile uint32_t        EMACxSA0INV ;

 __EMACxSA1bits_t        EMACxSA1 ;
 volatile uint32_t        EMACxSA1CLR ;
 volatile uint32_t        EMACxSA1SET ;
 volatile uint32_t        EMACxSA1INV ;

 __EMACxSA2bits_t        EMACxSA2 ;
 volatile uint32_t        EMACxSA2CLR ;
 volatile uint32_t        EMACxSA2SET ;
 volatile uint32_t        EMACxSA2INV ;
 
} DRV_ETHERNET_REGISTERS;

//*****************************************************************************
/* RMII Speed Selection

  Summary:
    Lists the possible speed selection for the Reduced Media Independent 
    Interface (RMII).

  Description:
    This enumeration lists the possible speed selection for RMII.
    The body contains only two states: RMII_10Mbps or RMII_100Mbps.

  Remarks:
    This enumeration is processor specific and is defined in the processor-
    specific header files (see processor.h).
*/
typedef enum {

    DRV_ETH_RMII_10Mbps  = 0x00,
    DRV_ETH_RMII_100Mps  = 0x01,

} DRV_ETH_RMII_SPEED;


// *****************************************************************************
/* Ethernet Receive Filter Flags

  Summary:
    Defines the receive filter flags

  Description:
    This enumeration defines the receive filter flags.

  Remarks:
    Multiple values can be OR-ed together.

    The values in this enumeration are displayed in the order of priority
    that the receive filter state machine works, with the highest priority first.
    Once a filter accepts or rejects a packet, further filters are not tried.
    If a packet isn't rejected/accepted after all filters are tried, it will be rejected by
    default!
*/

typedef enum
{
    // Frames with wrong CRC are accepted
    DRV_ETH_FILT_CRC_ERR_ACCEPT = _ETHRXFC_CRCERREN_MASK,

    // Runt frames accepted
    DRV_ETH_FILT_RUNT_ACCEPT = _ETHRXFC_RUNTERREN_MASK,

    // Frames with wrong CRC are rejected
    DRV_ETH_FILT_CRC_ERR_REJECT = _ETHRXFC_CRCOKEN_MASK,

    // Runt frames rejected
    DRV_ETH_FILT_RUNT_REJECT = _ETHRXFC_RUNTEN_MASK,

    // Me unicast accepted
    DRV_ETH_FILT_ME_UCAST_ACCEPT = _ETHRXFC_UCEN_MASK,

    // Not me unicast accepted
    DRV_ETH_FILT_NOTME_UCAST_ACCEPT = _ETHRXFC_NOTMEEN_MASK,

    // Multicast accepted
    DRV_ETH_FILT_MCAST_ACCEPT = _ETHRXFC_MCEN_MASK,

    // Broadcast accepted
    DRV_ETH_FILT_BCAST_ACCEPT = _ETHRXFC_BCEN_MASK,

    // Hash table matches destination address accepted
    DRV_ETH_FILT_HTBL_ACCEPT = _ETHRXFC_HTEN_MASK,

    // Magic packet accepted
    DRV_ETH_FILT_MAGICP_ACCEPT = _ETHRXFC_MPEN_MASK,


    // All Filters
    DRV_ETH_FILT_ALL_FILTERS = DRV_ETH_FILT_CRC_ERR_ACCEPT  | DRV_ETH_FILT_RUNT_ACCEPT        |
                               DRV_ETH_FILT_CRC_ERR_REJECT  | DRV_ETH_FILT_RUNT_REJECT        |
                               DRV_ETH_FILT_ME_UCAST_ACCEPT | DRV_ETH_FILT_NOTME_UCAST_ACCEPT |
                               DRV_ETH_FILT_MCAST_ACCEPT    | DRV_ETH_FILT_BCAST_ACCEPT       |
                               DRV_ETH_FILT_HTBL_ACCEPT     | DRV_ETH_FILT_MAGICP_ACCEPT 
} DRV_ETH_RX_FILTERS;


// *****************************************************************************
/* Ethernet Pattern Match Modes

  Summary:
    Defines pattern match modes

  Description:
    This enumeration defines the Ethernet pattern match modes.

  Remarks:
    These are mutually exclusive modes, not flags.  However,
    DRV_ETH_FILT_PMATCH_INVERT act as a flag and can be applied to any value.
*/

typedef enum
{
    // Simple Pattern Match accepted
    DRV_ETH_FILT_PMATCH_ACCEPT = 1,

    // Pattern Match AND destination==me
    DRV_ETH_FILT_PMATCH_ME_UCAST_ACCEPT,

    // Pattern Match AND destination!=me
    DRV_ETH_FILT_PMATCH_NOTME_UCAST_ACCEPT,

    // Pattern Match AND destination!=unicast
    DRV_ETH_FILT_PMATCH_MCAST_ACCEPT,

    // Pattern Match AND destination==unicast
    DRV_ETH_FILT_PMATCH_NOT_MCAST_ACCEPT,

    // Pattern Match AND destination==broadcast
    DRV_ETH_FILT_PMATCH_BCAST_ACCEPT,

    // Pattern Match AND destination!=broadcast
    DRV_ETH_FILT_PMATCH_NOT_BCAST_ACCEPT,

    // Pattern Match AND hash table filter match (regardless of the
    // DRV_ETH_FILT_HTBL_ACCEPT setting)
    DRV_ETH_FILT_PMATCH_HTBL_ACCEPT,

    // Pattern Match AND packet ==magic packet
    DRV_ETH_FILT_PMATCH_MAGICP_ACCEPT,

    // If set, the pattern must NOT match for a successful Pattern Match to occur!
    DRV_ETH_FILT_PMATCH_INVERT = 0x80000000

} DRV_ETH_PMATCH_MODE;


// *****************************************************************************
/* Ethernet Event Flags

  Summary:
    Ethernet event flags

  Description:
    This enumeration defines flags for the possible Ethernet events that can
    cause interrupts.
*/

