aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_tests/firmware/src/config/pic32mzef_nvm/driver/ethmac/src/dynamic/drv_eth_pic32_lib.h
typedef enum
{
    // RX FIFO overflow
    DRV_ETH_EV_RXOVFLOW = _ETHIRQ_RXOVFLW_MASK, 

    // RX buffer not available (descriptor overrun)
    DRV_ETH_EV_RXBUFNA = _ETHIRQ_RXBUFNA_MASK,

    // TX abort condition
    DRV_ETH_EV_TXABORT = _ETHIRQ_TXABORT_MASK,

    // TX done
    DRV_ETH_EV_TXDONE = _ETHIRQ_TXDONE_MASK, 

    // RX activity
    DRV_ETH_EV_RXACT = _ETHIRQ_RXACT_MASK, 

    // RX packet pending
    DRV_ETH_EV_PKTPEND = _ETHIRQ_PKTPEND_MASK,

    // RX packet successfully received
    DRV_ETH_EV_RXDONE = _ETHIRQ_RXDONE_MASK, 

    // Full watermark reached
    DRV_ETH_EV_FWMARK = _ETHIRQ_FWMARK_MASK, 

    // Empty watermark reached
    DRV_ETH_EV_EWMARK = _ETHIRQ_EWMARK_MASK,

    // RX bus error
    DRV_ETH_EV_RXBUSERR = _ETHIRQ_RXBUSE_MASK,

    // TX bus error
    DRV_ETH_EV_TXBUSERR = _ETHIRQ_TXBUSE_MASK,

    // All events
    DRV_ETH_EV_ALL = (DRV_ETH_EV_RXOVFLOW | DRV_ETH_EV_RXBUFNA | DRV_ETH_EV_TXABORT |
                           DRV_ETH_EV_TXDONE   | DRV_ETH_EV_RXACT   | DRV_ETH_EV_PKTPEND |
                           DRV_ETH_EV_RXDONE   | DRV_ETH_EV_FWMARK  | DRV_ETH_EV_EWMARK  |
                           DRV_ETH_EV_RXBUSERR | DRV_ETH_EV_TXBUSERR )
} DRV_ETH_EVENTS;


//*****************************************************************************
/* MII Clock Selection

  Summary:
    Lists the possible speed selection for the Reduced Media Independent 
    Interface (RMII).

  Description:
    This enumeration lists the possible speed selection for RMII.
    The body contains only two states: RMII_10Mbps or RMII_100Mbps.

  Remarks:
    This enumeration is processor specific and is defined in the processor-
    specific header files (see processor.h).
*/
typedef enum {

    ETH_MIIM_SYSCLK_DIV_BY_4   /*DOM-IGNORE-BEGIN*/ = 0x00 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_RSVD   /*DOM-IGNORE-BEGIN*/ = 0x01 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_6   /*DOM-IGNORE-BEGIN*/ = 0x02 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_8   /*DOM-IGNORE-BEGIN*/ = 0x03 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_10  /*DOM-IGNORE-BEGIN*/ = 0x04 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_14  /*DOM-IGNORE-BEGIN*/ = 0x05 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_20  /*DOM-IGNORE-BEGIN*/ = 0x06 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_28  /*DOM-IGNORE-BEGIN*/ = 0x07 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_40  /*DOM-IGNORE-BEGIN*/ = 0x08 /*DOM-IGNORE-END*/

} ETH_MIIM_CLK;
// *****************************************************************************
// *****************************************************************************
// Section: Driver Library Interface Routines
// *****************************************************************************
// *****************************************************************************

//******************************************************************************
/* Function:
    void DRV_ETH_PauseTimerSet(DRV_ETHERNET_REGISTERS* pEthReg, uint16_t PauseTimerValue)

  Summary:
    Sets the Pause Timer value used for flow control.

  Description:
    This function sets the Pause Timer value used for flow control.

  Precondition:
    Write to the Pause Timer register before enabling the receiver. Call this 
	function before calling DRV_ETH_ReceiveEnable.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    PauseTimerValue - used for Flow Control

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_PauseTimerSet(DRV_ETHERNET_REGISTERS* pEthReg, uint16_t PauseTimerValue);


//******************************************************************************
/* Function:
    void DRV_ETH_Enable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables the Ethernet module.

  Description:
    This function enables the Ethernet module.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_Enable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_Disable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Disables the Ethernet module.

  Description:
    This function disables the Ethernet module.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_Disable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_TxRTSEnable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables the Ethernet transmit request to send.

  Description:
    This function enables the Ethernet request to send. Transmit logic is activated
    and any packets defined in the Ethernet descriptor table are transmitted.

  Precondition:
    The TX descriptor list and TX DMA must be initialized using 
    DRV_ETH_TransmitPacketDescStartAddrSet.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    This status is cleared by hardware when the transmission is complete.

    None
*/

void DRV_ETH_TxRTSEnable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_TxRTSDisable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Aborts an Ethernet module transmission.

  Description:
    This function aborts an Ethernet module transmission and disables the 
    transmitter after the current packet has completed.

  Precondition
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    When disabled by software, transmission stops after the current packet
    has been completed.

    None
*/

void DRV_ETH_TxRTSDisable(DRV_ETHERNET_REGISTERS* pEthReg);


