aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_tests/firmware/src/config/pic32mzef_nvm/driver/ethmac/src/dynamic/drv_eth_pic32_lib.h
//******************************************************************************
/* Function:
    void DRV_ETH_RxEnable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables the Ethernet receive logic.

  Description:
    This function enables the Ethernet receive logic. Packets are received and
    stored in the receive buffer as controlled by the filter configuration.

  Precondition:
    All receive registers must be configured before calling this function.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_RxEnable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_RxDisable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Disables the Ethernet module receive logic.

  Description:
    This function disables the Ethernet receive logic.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    Disabling Ethernet receive is not recommended for making changes to any
    receive-related registers. After the receiver has been enabled,
    the Ethernet module must be reinitialized to implement changes.

    None
*/

void DRV_ETH_RxDisable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_AutoFlowControlEnable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables the Ethernet Automatic Flow Control logic.

  Description:
    This function enables Ethernet Automatic Flow Control logic.
	This function performs atomic register access.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    The full and empty watermarks are used to automatically enable and disable
    flow control, respectively. When the number of received buffers rises to
    the full watermark, flow control is automatically enabled.
    When the receive buffer count falls to the empty watermark, flow control is
    automatically disabled.

    None
*/

void DRV_ETH_AutoFlowControlEnable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_RxBufferCountDecrement(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Causes the Receive Descriptor Buffer Counter to decrement by 1.

  Description:
    This function causes the Receive Descriptor Buffer Counter to decrement by 1.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    Hardware increments the receive buffer counter and software decrements it.
    If the receive buffer counter is incremented by the receive logic
    at the same time, the receive buffer counter will appear unchanged.

    Always reads as '0', so there is no get value routine.

    None
*/

void DRV_ETH_RxBufferCountDecrement(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    int DRV_ETH_RxSetBufferSize(DRV_ETHERNET_REGISTERS* pEthReg, int rxBuffSize)

  Summary:
    Sets the Ethernet module receive buffer size.

  Description:
   This function sets the required buffer size for the receive operation.
    In this implementation, all receive descriptors use the same buffer 
	size (unlike the transmission flow where each descriptor can have 
	a different buffer size)

  Precondition:
    0 < rxBuffSize <= 2032

  Parameters:
    pEthReg - pointer to the Ethernet registers
    ReceiveBufferSize - In units of 16 bytes, must be a value of 0x01 to 0x7F, 
                        0x00 is invalid
  
  Returns:
    None.

  Example:

  Remarks:
    None
	This function should be part of the initialization process and should
	NOT be called when the rx process is active! The receive buffer size 
	is always TRUNCATED to a multiple of 16 bytes.
*/
int DRV_ETH_RxSetBufferSize(DRV_ETHERNET_REGISTERS* pEthReg, int rxBuffSize);


//******************************************************************************
/* Function:
    void DRV_ETH_TxPacketDescAddrSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t *txPacketDescStartAddr)

  Summary:
    Sets the Ethernet module transmit packet descriptor start address.

  Description:
    This function sets the Ethernet transmit packet descriptor start address.

  Precondition:
    No transmit, receive, or DMA operations should be in progress when this
    function is called. Call this function before enabling transmit and
    receive.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    txPacketDescStartAddr - This address must be 4-byte aligned. (The least 
                            significant 2 bits must be '00'.)

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_TxPacketDescAddrSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t *txPacketDescStartAddr);


//******************************************************************************
/* Function:
    uint8_t *DRV_ETH_TxPacketDescAddrGet(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the address of the next descriptor to be transmitted.

  Description:
    This function gets the address of the next transmit descriptor.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    Transmit Packet Descriptor Start Address.

  Example:

  Remarks:
    None
*/

uint8_t *DRV_ETH_TxPacketDescAddrGet(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_RxPacketDescAddrSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t *rxPacketDescStartAddr)

   Summary:
    Sets the Ethernet module receive packet descriptor start address.

  Description:
    This function sets the Ethernet receive packet descriptor start address.

  Precondition:
    No transmit, receive, or DMA operations should be in progress when this
    function is called. Call this function before enabling transmit and
    receive.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    rxPacketDescStartAddr - This address must be 4-byte aligned. (The least 
                            significant 2 bits must be '00'.)

  Returns:
    None.

  Example:

