aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_tests/firmware/src/config/pic32mzef_nvm/driver/ethmac/src/dynamic/drv_eth_pic32_lib.h
  Remarks:
    None
*/

void DRV_ETH_RxPacketDescAddrSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t *rxPacketDescStartAddr);



//******************************************************************************
/* Function:
    uint8_t *DRV_ETH_RxPacketDescAddrGet(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the address of the next receive descriptor.

  Description:
    This function gets the address of the next receive descriptor to be used.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - ReceivePacketDescriptorAddress - receive packet descriptor address

  Example:

  Remarks:
    None
*/

uint8_t * DRV_ETH_RxPacketDescAddrGet(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void  DRV_ETH_RxFiltersHTSet ( DRV_ETHERNET_REGISTERS* pEthReg, uint64_t htable )

  Summary:
    Sets the hash table for the hash table RX filter.

  Description:
     This function sets the hash table for the hash table RX filter.

  Precondition:
    This function should not be called when Ethernet RX operation is enabled and the
    hash filter is active.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    htable      - The hash table itself

  Returns:
    None.

  Example:

  Remarks:
    Properly set the hash table with this function before enabling the Hash
    Table filter.
*/
void  DRV_ETH_RxFiltersHTSet ( DRV_ETHERNET_REGISTERS* pEthReg, uint64_t htable );

//******************************************************************************
/* Function:
    void DRV_ETH_RxFiltersSet (DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_RX_FILTERS rxFilters )

  Summary:
    Sets the acceptance/rejection filters for the Ethernet receive.

  Description:
    This function sets the acceptance/rejection filters for the Ethernet receive
    mechanism.  Multiple filters can be OR-ed together.  All filter specified
    in rxFilters will be set.

  Precondition:
   This function should not be called when Ethernet RX operation is enabled.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    rxFilters   - RX filters that are to be set

  Returns:
    None.

  Example:

  Remarks:
    All filters except Pattern Match can be set. Use DRV_ETH_RxFiltersPMSet().
    Before enabling the Hash Table filter, the hash table values should be set
    using DRV_ETH_RxFiltersHTSet().
    See the definition of the DRV_ETH_RX_FILTERS for the priority of the RX filters.
*/
void DRV_ETH_RxFiltersSet (DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_RX_FILTERS rxFilters );

//******************************************************************************
/* Function:
    void DRV_ETH_RxFiltersClr (DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_RX_FILTERS rxFilters )

  Summary:
     Clears the acceptance/rejection filters for the Ethernet receive.

  Description:
    This function clears the acceptance/rejection filters for the Ethernet receive
    mechanism.  Multiple filters can be OR-ed together.  All filters specified
    in rxFilters will be cleared.

  Precondition:
    This function should not be called when Ethernet RX operation is enabled.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    rxFilters   - RX filters that are to be cleared

  Returns:
    None.

  Example:

  Remarks:
    All filters except Pattern Match can be cleared. Use DRV_ETH_RxFiltersPMClr().
*/
void DRV_ETH_RxFiltersClr (DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_RX_FILTERS rxFilters );


//******************************************************************************
/* Function:
    void DRV_ETH_RxFullWmarkSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t watermarkValue)

  Summary:
    Sets the Ethernet module to receive a full watermark.

  Description:
    This function sets the Ethernet to receive a full watermark with a new value.

    The software controlled RX Buffer Full Watermark (Wmark) Pointer is compared
    against the receive buffer count to determine the full watermark
    condition for the full watermark interrupt and for enabling flow control
    if Auto Flow Control is enabled.

    The Full Wmark value should always be greater than the Empty Wmark value.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    watermarkValue - Full watermark value

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_RxFullWmarkSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t watermarkValue);


//******************************************************************************
/* Function:
    void DRV_ETH_RxEmptyWmarkSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t watermarkValue)

  Summary:
    Sets the Ethernet module receive empty water mark.

  Description:
    This function sets the Ethernet receive empty water mark with a new value.
    The software controlled Receive Buffer Empty Wmark is compared against
    the receive buffer count to determine the empty watermark condition
    for the empty watermark interrupt and for disabling flow control
    if Auto Flow Control is enabled.

    The Full Wmark value should always be greater than the Empty Wmark value.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    watermarkValue - Empty watermark value

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_RxEmptyWmarkSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t watermarkValue);


//******************************************************************************
/* Function:
    void DRV_ETH_EventsEnableSet ( DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_EVENTS eEvents )

  Summary:
    Enables the events that will generate interrupts for the Ethernet controller.

  Description:
    The function enables the events that will generate interrupts for the Ethernet
    controller.  Multiple events can be OR-ed together.  Any event that is set
    in the eEvents will be enabled , the other events won't be touched.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    eEvents  - Events with the significance described in the DRV_ETH_EVENTS definition.

  Returns:
    None.

  Example:

