aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_tests/firmware/src/config/pic32mzef_nvm/driver/ethmac/src/dynamic/drv_eth_pic32_lib.h
  Remarks:
 */

void DRV_ETH_EventsEnableSet ( DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_EVENTS eEvents );


//*******************************************************************************
/*  Function:
    void DRV_ETH_EventsEnableClr ( DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_EVENTS eEvents )

  Summary:
    Disables the events that will generate interrupts.

  Description:
    The function disables the events that will generate interrupts for the Ethernet
    controller.  Multiple events can be OR-ed together.  Any event that is set
    in the eEvents will be disabled , the other events won't be touched.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    eEvents  - Events with the significance described in the DRV_ETH_EVENTS definition.

  Returns:
    None.

  Example:

  Remarks:
*/

void DRV_ETH_EventsEnableClr ( DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_EVENTS eEvents );




//******************************************************************************
/* Function:
    void DRV_ETH_MIIResetEnable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables the EMAC MIIM Soft reset.

  Description:
    This function enables the EMAC MIIM soft reset.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_MIIResetEnable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_MIIResetDisable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Disables the EMAC Soft reset.

  Description:
    This function disables the EMAC MIIM Soft reset.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_MIIResetDisable(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    void DRV_ETH_MaxFrameLengthSet(DRV_ETHERNET_REGISTERS* pEthReg, uint16_t MaxFrameLength)

  Summary:
    Sets the EMAC maximum frame length.

  Description:
    This function sets the EMAC maximum frame length.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    MaxFrameLength - Maximum frame length

  Returns:
    None.

  Example:

  Remarks:
    This field resets to 0x05EE, which represents a maximum receive
    frame of 1518 bytes.
    An untagged maximum size Ethernet frame is 1518 bytes.
    A tagged frame adds four octets for a total of 1522 bytes.
    If a shorter/longer maximum length restriction is desired, program
    this 16-bit field.

    If a proprietary header is allowed, this field should be adjusted 
    accordingly. For example, if 4-byte headers are prepended to frames, 
    MACMAXF could be set to 1527 bytes. This would allow the maximum VLAN 
    tagged frame plus the 4-byte header.

    None
*/

void DRV_ETH_MaxFrameLengthSet(DRV_ETHERNET_REGISTERS* pEthReg, uint16_t MaxFrameLength);

//******************************************************************************
/* Function:
    uint8_t DRV_ETH_EthernetIsBusy(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the status value of the Ethernet logic busy.

  Description:
    This function sets the value of the Ethernet logic busy. A request indicates 
    that the module has just been turned ON or is completing a transaction after 
    being turned OFF.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - true  - Ethernet logic has been turned ON or is completing a transaction
    - false - Ethernet logic is idle

  Example:

  Remarks:
    None
*/

bool DRV_ETH_EthernetIsBusy(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    uint8_t DRV_ETH_RxPacketCountGet(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the value of the receive packet buffer count.

  Description:
    This function gets the value of the receive packet buffer count.
    When a packet has been successfully received, this value is incremented
    by hardware. Software decrements the counter after a packet has been read.
    Call  DRV_ETH_ReceiveBufferCountDecrement(DRV_ETHERNET_REGISTERS* pEthReg) to decrement.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - RxPacketCount - Number of received packets in memory

  Example:

  Remarks:
    Receive Packet Buffer Counter cannot be decremented below 0x00
    Cleared when the Ethernet module is reset.

    The Receive Packet Buffer Count is not set to '0' when the Ethernet module
    is turned OFF. This allows software to continue to utilize and decrement
    the count.

    None
*/

uint8_t DRV_ETH_RxPacketCountGet(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    void DRV_ETH_EventsClear(DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_EVENTS evmask)

  Summary:
    Clears the Ethernet module event/interrupt source status as a group, using a mask.

  Description:
    This function clears the Ethernet module interrupt source status using a mask.
    Logically 'OR' the masks together. Any masks not ORed with the others will 
    be disabled.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    intmask - Members of DRV_ETH_EVENTS logically ORed together

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_EventsClear(DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_EVENTS evmask);

//******************************************************************************
/* Function:
    bool DRV_ETH_TransmitIsBusy(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the status value of the Ethernet transmit logic busy status

  Description:
    This function gets the value of the Ethernet transmit logic busy status.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - true  - Transmit logic is sending data
    - false - Transmit logic is idle

  Example:

