aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_tests/firmware/src/config/pic32mzef_nvm/driver/ethmac/src/dynamic/drv_eth_pic32_lib.h
  Remarks:
    None
*/

bool DRV_ETH_TransmitIsBusy(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    bool DRV_ETH_ReceiveIsBusy(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the Ethernet receive logic busy status.

  Description:
    This function gets the Ethernet receive logic busy status.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - true  - Receive logic is receiving data
    - false - Receive logic is idle

  Example:

  Remarks:
    None
*/

bool DRV_ETH_ReceiveIsBusy(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    void DRV_ETH_BackToBackIPGSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t backToBackIPGValue)

  Summary:
    Sets the EMAC back-to-back interpacket gap.

  Description:
    This function sets the EMAC back-to-back interpacket gap.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    backToBackIPGValue - Back-to-back interpacket gap

  Returns:
    None.

  Example:

  Remarks:
    In Full-Duplex mode, the register value should be the desired period
    in nibble times minus 3. In Full-Duplex, the recommended setting is 0x15.

    In Half-Duplex mode, the register value should be the desired period
    in nibble times minus 6. n Half-Duplex, the recommended setting is 0x12.

    None
*/

void DRV_ETH_BackToBackIPGSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t backToBackIPGValue);

//******************************************************************************
/* Function:
    void DRV_ETH_NonBackToBackIPG1Set(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t nonBackToBackIPGValue)

  Summary:
    Sets the EMAC non-back-to-back interpacket gap register 1.

  Description:
    This function sets the EMAC non-back-to-back interpacket gap register 1.
    A value of 0x0C is recommended.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    nonBackToBackIPGValue - Non-back-to-back interpacket gap

  Returns:
    None.

  Example:

  Remarks:
    This is a programmable field representing the optional carrierSense window
    referenced in the IEEE 802.3 Specification.
    If a carrier is detected during the timing of IPGR1, the MAC defers to the carrier.
    If, however, the carrier comes after IPGR1, the MAC continues timing IPGR2 and
    transmits, knowingly causing a collision, thereby ensuring fair access to the medium.
    Its range of values is 0x0 to IPGR2. Its recommended value is 0xC (12d).

    None
*/

void DRV_ETH_NonBackToBackIPG1Set(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t nonBackToBackIPGValue);

//******************************************************************************
/* Function:
    void DRV_ETH_NonBackToBackIPG2Set(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t nonBackToBackIPGValue)

  Summary:
    Sets the EMAC non-back-to-back interpacket gap register 2.

  Description:
    This function sets the EMAC non-back-to-back interpacket gap register 2.
    A value of 0x12 is recommended.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    nonBackToBackIPGValue - Non-back-to-back interpacket gap

  Returns:
    None.

  Example:

  Remarks:
    This is a programmable field representing the non-back-to-back
    Inter-Packet-Gap. Its recommended value is 0x12 (18d), which represents
    the minimum IPG of 0.96 us (in 100 Mbps) or 9.6 us (in 10 Mbps).

    None
*/

void DRV_ETH_NonBackToBackIPG2Set(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t nonBackToBackIPGValue);

//******************************************************************************
/* Function:
    void DRV_ETH_CollisionWindowSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t collisionWindowValue)

  Summary:
    Sets the EMAC collision window.

  Description:
    This function sets the EMAC collision window.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    collisionWindowValue - Collision window

  Returns:
    None.

  Example:

  Remarks:
    This is a programmable field representing the slot time or collision window
    during which collisions occur in properly configured networks. Since the
    collision window starts at the beginning of transmission, the preamble
    and SFD is included. Its default of 0x37 (55d) corresponds to the count of
    frame bytes at the end of the window.

    None
*/

void DRV_ETH_CollisionWindowSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t collisionWindowValue);

//******************************************************************************
/* Function:
    void DRV_ETH_ReTxMaxSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t retransmitMax)

  Summary:
    Sets the EMAC maximum retransmissions.

  Description:
    This function sets the EMAC maximum retransmissions.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    retransmitMax - Maximum number of retransmissions

  Returns:
    None.

  Example:

  Remarks:
    This is a programmable field specifying the number of retransmission
    attempts following a collision before aborting the packet due to excessive
    collisions. The IEEE 802.3 Specification standard specifies the maximum
    number of attempts (attemptLimit) to be 0xF (15d). Its default is 000.

    None
*/

void DRV_ETH_ReTxMaxSet(DRV_ETHERNET_REGISTERS* pEthReg, uint16_t retransmitMax);

//******************************************************************************
/* Function:
    void DRV_ETH_RMIIResetEnable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables EMAC Reset RMII.

  Description:
    This function enables EMAC Reset RMII.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_RMIIResetEnable(DRV_ETHERNET_REGISTERS* pEthReg);


