aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_tests/firmware/src/config/pic32mzef_nvm/driver/ethmac/src/dynamic/drv_eth_pic32_lib.h
//******************************************************************************
/* Function:
    void DRV_ETH_RMIIResetDisable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Disables EMAC Reset RMII.

  Description:
    This function disables EMAC Reset RMII for normal operation.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_RMIIResetDisable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_RMIISpeedSet(DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_RMII_SPEED RMIISpeed)

  Summary:
    Sets EMAC RMII Speed.

  Description:
    This function sets EMAC RMII speed. RMII speed can be either RMII_100Mbps or 
    RMII_10Mbps.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    RMIISpeed - RMII_100Mbps or RMII_10Mbps of type DRV_ETH_RMII_SPEED

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_RMIISpeedSet(DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_RMII_SPEED RMIISpeed);

//******************************************************************************
/* Function:
    void DRV_ETH_TxPauseEnable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables the transmission Pause frames.

  Description:
    This function enables the transmission Pause frames. The Pause frames are 
    allowed for transmission.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_TxPauseEnable(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    void DRV_ETH_RxPauseEnable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables the EMAC receive flow control.

  Description:
    This function enables the EMAC receive flow control. The EMAC will act upon 
    the received Pause frames.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    None
*/

void DRV_ETH_RxPauseEnable(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
     void DRV_ETH_MACSetAddress (DRV_ETHERNET_REGISTERS* pEthReg, uint8_t *bAddress )

  Summary:
    Sets the MAC address.

  Description:
    This function sets the selected MAC Station Address.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    bAddress    - standard MAC address, 6 bytes, Network order!

  Returns:
    None.

  Example:

  Remarks:
    On a reset, this register is loaded with the factory preprogrammed
    station address.
*/

void DRV_ETH_MACSetAddress (DRV_ETHERNET_REGISTERS* pEthReg, uint8_t *bAddress );

//******************************************************************************
/* Function:
    void DRV_ETH_MACGetAddress (DRV_ETHERNET_REGISTERS* pEthReg, uint8_t *bAddress )

  Summary:
    Returns the current MAC address.

  Description:
    This function returns the current MAC address.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    bAddress    - Address to store a standard MAC address, 6 bytes, Network order!

  Returns:
    None.

  Example:

  Remarks:
    On a reset, this register is loaded with the factory preprogrammed
    station address.

    None
*/
void DRV_ETH_MACGetAddress (DRV_ETHERNET_REGISTERS* pEthReg, uint8_t *bAddress );

//******************************************************************************
/* Function:
    uint16_t DRV_ETH_FramesTxdOkCountGet(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the count of Ethernet Control Frames transmitted successfully.

  Description:
    This function gets the count of Ethernet Control Frames transmitted successfully.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - count - count of control frames transmitted correctly

  Example:

  Remarks:
    None
*/

uint16_t DRV_ETH_FramesTxdOkCountGet(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    uint16_t DRV_ETH_FramesRxdOkCountGet(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the count of the frames frames received successfully.

  Description:
    This function gets the count of the frames received successfully.
    Increment count for frames received successfully by the RX Filter.
    This count will not be incremented if there is a Frame Check Sequence (FCS)
    or Alignment error.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - value - Count of frames received correctly

  Example:

  Remarks:
    None
*/

uint16_t DRV_ETH_FramesRxdOkCountGet(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    uint16_t DRV_ETH_RxOverflowCountGet(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the count of the dropped Ethernet receive frames.

  Description:
    This function gets the count of the dropped Ethernet receive frames.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - count - uint16_t receiver overflow counts

  Example:

  Remarks:
    None
*/

uint16_t DRV_ETH_RxOverflowCountGet(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    uint16_t DRV_ETH_FCSErrorCountGet(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the count of the frame check sequence error.

  Description:
    This function gets the count of the frame check sequence error.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - value - Count of FCS Errors

  Example:

