aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_tests/firmware/src/config/pic32mzef_nvm/driver/ethmac/src/dynamic/drv_eth_pic32_lib.h
  Remarks:
    None
*/

uint16_t DRV_ETH_FCSErrorCountGet(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    uint16_t DRV_ETH_AlignErrorCountGet(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the count of Ethernet alignment errors.

  Description:
    This function gets the count of Ethernet alignment errors.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - value - Count of alignment errors

  Example:

  Remarks:
    None
*/

uint16_t DRV_ETH_AlignErrorCountGet(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    uint16_t DRV_ETH_SingleCollisionCountGet(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the count of the frames transmitted successfully on a second attempt.

  Description:
    This function gets the count of the frames transmitted successfully on
    a second attempt.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - count - Count of frames transmitted successfully on second attempt

  Example:

  Remarks:
    None
*/

uint16_t DRV_ETH_SingleCollisionCountGet(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    uint16_t DRV_ETH_MultipleCollisionCountGet(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the count of the frames transmitted successfully after there was more 
    than one collision.

  Description:
    This function gets the count of the frames transmitted successfully after 
    there was more than one collision.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - count - Count of multiple collision frames

  Example:

  Remarks:
    None
*/

uint16_t DRV_ETH_MultipleCollisionCountGet(DRV_ETHERNET_REGISTERS* pEthReg);

//*******************************************************************************
/*  Function:
    void DRV_ETH_EventsClr ( DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_EVENTS eEvents )

  Summary:
    Clears the selected events for the Ethernet controller.

  Description:
    The function clears the selected events for the Ethernet controller.  Multiple
    events can be OR-ed together. Any event that is set in the eEvents will be
    cleared, the other events won't be touched.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    eEvents  - Events with the significance described in the DRV_ETH_EVENTS definition.

  Returns:
    None.

  Example:

  Remarks:
    The DRV_ETH_EV_FWMARK cannot be cleared directly. It is cleared indirectly by
    DRV_ETH_RxAcknowledgePacket/DRV_ETH_RxAcknowledgeBuffer.

    The DRV_ETH_EV_EWMARK cannot be cleared directly. It is cleared by hardware when
    receiving a new packet.

    The DRV_ETH_EV_PKTPEND cannot be cleared directly. It is cleared indirectly by
    DRV_ETH_RxAcknowledgePacket/DRV_ETH_RxAcknowledgeBuffer.

*/

void DRV_ETH_EventsClr( DRV_ETHERNET_REGISTERS* pEthReg, DRV_ETH_EVENTS eEvents );

/*******************************************************************************
  Function:
    DRV_ETH_EVENTS DRV_ETH_EventsGet ( DRV_ETHERNET_REGISTERS* pEthReg )

  Summary:
    Returns the active events for the Ethernet controller.

  Description:
    This function returns the active events for the Ethernet controller.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    Events with the significance described in the DRV_ETH_EVENTS definition.

  Example:

  Remarks:
 *****************************************************************************/

DRV_ETH_EVENTS DRV_ETH_EventsGet ( DRV_ETHERNET_REGISTERS* pEthReg );


//******************************************************************************
/* Function: 
    bool DRV_ETH_IsEnabled(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the Ethernet receive logic busy status.

  Description:
    This function gets the Ethernet receive logic busy status.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - true  - Receive logic is receiving data
    - false - Receive logic is idle

  Example:

  Remarks:
    None
*/

//******************************************************************************
/* Function:
    bool DRV_ETH_IsEnabled(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the Ethernet module enable status.

  Description:
    This function returns the Ethernet module enable status.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - true  - Ethernet module is enabled
    - false - Ethernet module is disabled

  Example:

  Remarks:
*/
bool DRV_ETH_IsEnabled(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    void DRV_ETH_MIIMNoPreEnable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables EMAC MIIM No Preamble (suppresses preamble).

  Description:
    This function enables EMAC MIIM No Preamble (suppresses preamble). The MII 
    Management will perform read/write cycles without the 32-bit preamble field.
    Some PHYs support suppressed preamble.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
*/
void DRV_ETH_MIIMNoPreEnable(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    void DRV_ETH_MIIMNoPreDisable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Disables EMAC No Preamble (allows preamble).

  Description:
    This function disables EMAC No preamble (allows preamble). Normal read/write 
    cycles are performed.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

