aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_tests/firmware/src/config/pic32mzef_nvm/driver/ethmac/src/dynamic/drv_eth_pic32_lib.h
  Remarks:
*/
void DRV_ETH_MIIMNoPreDisable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_MIIMScanIncrEnable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables EMAC MIIM Scan Increment.

  Description:
    This function enables EMAC MIIM Scan Increment. The MII Management module will 
    perform read cycles across a range of PHYs. The read cycles will start from 
    address 1 through the value set in the PHY address register.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    The read cycles will start at PHY address 1 and continue through the value
    set for as the PHY address register.

*/
void DRV_ETH_MIIMScanIncrEnable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_MIIMScanIncrDisable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Disables the EMAC MIIM Scan Increment.

  Description:
    This function disables the EMAC MIIM Scan Increment. Allows continuous reads 
    of the same PHY.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
*/
void DRV_ETH_MIIMScanIncrDisable(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    bool DRV_ETH_MIIMIsBusy(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the MII management busy status.

  Description:
    This function returns the MII management busy status.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - true  - The MII Management module is currently performing an MII Management 
              read or write cycle
    - false - The MII Management is free

  Example:

  Remarks:
*/
bool DRV_ETH_MIIMIsBusy(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    void DRV_ETH_PHYAddressSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t phyAddr)

  Summary:
    Sets the EMAC MIIM PHY address.

  Description:
    This function sets the EMAC MIIM PHY address. This field represents the 5-bit 
    PHY Address field of Management cycles. Up to 31 PHYs can be addressed (0 is reserved).

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    phyAddr - A 5-bit address of the PHY

  Returns:
    None.

  Example:

  Remarks:
*/
void DRV_ETH_PHYAddressSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t phyAddr);

//******************************************************************************
/* Function:
    void DRV_ETH_RegisterAddressSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t regAddr)

  Summary:
    Sets EMAC MIIM register address.

  Description:
    This function sets the EMAC MIIM register address. Up to 32 registers may 
    be accessed.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    regAddr - The (5-bit) address of the MII Registers.

  Returns:
    None.

  Example:

  Remarks:
*/
void DRV_ETH_RegisterAddressSet(DRV_ETHERNET_REGISTERS* pEthReg, uint8_t regAddr);

//******************************************************************************
/* Function:
    void DRV_ETH_ClearDataValid(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Clears the EMAC MIND register data valid indicator

  Description:
    This function clears the EMAC MIND register data valid indicator. 

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Remarks:
*/
void DRV_ETH_ClearDataValid(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_MIIMScanModeEnable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables MIIM scan mode.

  Description:
    This function enables MIIM scan mode. The MII Management module will perform 
    read cycles continuously. (Useful for monitoring the Link Fail.)

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
*/
void DRV_ETH_MIIMScanModeEnable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_MIIMScanModeDisable(DRV_ETHERNET_REGISTERS* pEthReg)
  Summary:
    Disables MIIM scan mode.

  Description:
    This function disables MIIM scan mode. Scan is disabled for Normal operation.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
*/
void DRV_ETH_MIIMScanModeDisable(DRV_ETHERNET_REGISTERS* pEthReg);


//******************************************************************************
/* Function:
    void DRV_ETH_MIIMWriteDataSet(DRV_ETHERNET_REGISTERS* pEthReg, uint16_t writeData)

  Summary:
    Sets the EMAC MIIM write data before initiating an MII write cycle.

  Description:
    This function sets the EMAC MIIM write data before initiating write cycle.

  Precondition:
    Prior to a call to this routine, the PHY and Register addresses
    should be set using DRV_ETH_MIIPHYAddressSet and DRV_ETH_MIIRegisterAddressSet.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    writeData - MII write data

  Returns:
    None.

  Example:

  Remarks:
*/
void DRV_ETH_MIIMWriteDataSet(DRV_ETHERNET_REGISTERS* pEthReg, uint16_t writeData);

//******************************************************************************
/* Function:
    void DRV_ETH_MIIMWriteStart(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Initiates an MII management write command.

  Description:
    This function initiates an MII management read command. The MII Management module 
    will perform a write cycle.

  Precondition:
    The PHY address and MII register address must be configured before a write
    using DRV_ETH_MIIPHYAddressSet(MY_ETH_INSTANCE, phyAddr)   and
    DRV_ETH_MIIRegisterAddressSet(MY_ETH_INSTANCE, regAddr)

    Data to be written must be first loaded into the MII write register using
    DRV_ETH_MIIMWriteDataSet(MY_ETH_INSTANCE, writeData)

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

