aws/amazon-freertos/projects/microchip/curiosity2_pic32mzef/mplab/aws_tests/firmware/src/config/pic32mzef_nvm/driver/ethmac/src/dynamic/drv_eth_pic32_lib.h
  Remarks:
*/
void DRV_ETH_MIIMWriteStart(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    void DRV_ETH_MIIMReadStart(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Initiates an MII management read command.

  Description:
    This function initiates an MII read command. The MII Management module will 
    perform a single read cycle. To get data, use DRV_ETH_MIIMReadDataGet.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
*/
void DRV_ETH_MIIMReadStart(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    uint16_t DRV_ETH_MIIMReadDataGet(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets EMAC MIIM management read data after a MII read cycle has completed.

  Description:
    This function gets EMAC MIIM management read data after a MII read cycle
    has completed.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - readData - MII read data

  Example:

  Remarks:
*/
uint16_t DRV_ETH_MIIMReadDataGet(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    bool DRV_ETH_DataNotValid(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Gets the MII management read data not valid status.

  Description:
    This function gets the MII management read data not valid status.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    - true  - The MII Management read cycle has not completed and the read data
              is not yet valid
    - false - The MII Management read cycle is complete and the read data is valid

  Example:

  Remarks:
*/
bool DRV_ETH_DataNotValid(DRV_ETHERNET_REGISTERS* pEthReg); 


//******************************************************************************
/* Function:
    void DRV_ETH_MIIMResetEnable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Enables EMAC Reset Media Independent Interface (MII) Management.

  Description:
    This function enables EMAC Reset MII Management and holds the MII Management 
    module in reset while enabled.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
    MII Management held in Reset after This function is called. Disable ResetMIIanagement 
    to return to normal operation.

*/
void DRV_ETH_MIIMResetEnable(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    void DRV_ETH_MIIMResetDisable(DRV_ETHERNET_REGISTERS* pEthReg)

  Summary:
    Disables EMAC Reset MII Management.

  Description:
    This function disables EMAC Reset MII Management.
    EMAC will resume normal operation.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers

  Returns:
    None.

  Example:

  Remarks:
*/
void DRV_ETH_MIIMResetDisable(DRV_ETHERNET_REGISTERS* pEthReg);

//******************************************************************************
/* Function:
    void DRV_ETH_MIIMClockSet(DRV_ETHERNET_REGISTERS* pEthReg, ETH_MIIM_CLK MIIMClock)

  Summary:
    Sets the EMAC MIM clock selection.

  Description:
    This function sets the EMAC MIIM clock selection.

  Precondition:
    None.

  Parameters:
    pEthReg - pointer to the Ethernet registers
    MIIMClock - of type ETH_MIIM_CLK - the system clock divisor for MII

  Returns:
    None.

  Example:

  Remarks:
    This field is used by the clock divide logic in creating the MII Management 
    Clock (MDC), which the IEEE 802.3 Specification defines to be no faster than 
    2.5 MHz. Some PHYs support clock rates up to 12.5 MHz.

*/
void DRV_ETH_MIIMClockSet(DRV_ETHERNET_REGISTERS* pEthReg , ETH_MIIM_CLK MIIMClock );

#ifdef __cplusplus
}
#endif


#endif //_DRV_ETH_LIB_H_

//******************************************************************************
/* End of File
*/
